package forthmodule


/** Задание 19: Авиакомпания 3. Наследование
    Создадим наследника класса Aircraft с названием Boeing747 и добавим ему свойство, обозначающее вместимость пассажиров
*/
//class Boeing747(): Aircraft("N201",2500 , 2.0) {
//    var passengers: Int = 500
//}
/** Задание 20: Авиакомпания 4. Интерфейс
    Изменим реализацию пассажирских самолетов. Создадим Интерфейс с названием Passenger со свойством,
    обозначающим вместимость пассажиров. Уберем это свойство у класса Boeing747
    и реализуем в нем новый интерфейс.
    Пусть свойство наследуемое от интерфейса, переопределяется в конструкторе.
 */
//class Boeing747(override var passengers: Int): Aircraft("N201",2500 , 2.0), Passengers {
//
//}
/**     Задание 22: Авиакомпания 6. Вывод информации
1. Создайте в классе Aircraft функцию для вывода характеристик самолетов в консоль.
2. Переопределите данную функцию в классе Boeing747, так чтобы еще выводилась информация о пассажирах
3. Сделайте свойства обоих классов видимыми только внутри этих классов и их наследниках,
кроме свойства наследуемого от интерфейса.
Свойства и функции интерфейсов не поддерживают модификатор protected и internal
 */
class Boeing747(override var passengers: Int = 300): Aircraft("N201",5000 , 2.0), Passengers {

//    override fun aboutBoard() {
//        super.aboutBoard()
//        println("Пассажировместительность самолета $passengers человек")
//    }
}