import firstmodule.*
import secondmodule.*
import thirdModule.*

fun main(args: Array<String>) {
    //Задание 1
    task1()
    //Задание 2
    task2()
    //Задание 3
    task3()
    //Задание 4
    task4()
    //Задание 5
    task5()
    //Задание 6
    task6()
    //Задание 7
    task7()
    //Задание 8
    task8()
    //Задание 9
    task9()
    //Задание 10
    task10()
    //Задание 11
    task11()
    //Задание 12
    task12(2020)
    //Задание 13
    task13("Уасилий", "Леопольд", "Матроскин")
    //Задание 14
    task14("Пупкин Василий Петрович", "Механик")
    task14("Пупкин Василий Петрович", 45, "Механик")
    task14("Пупкин Василий Петрович", "Разведен", "Механик")
    task14("Пупкин Василий Петрович", 45, "Разведен", "Механик")
    //Задание 15
    task15()
    //Задание 16
    task16(25.0)
}